Idealized_Reef_CFD/Scenario_36/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       1015288;
    }
    outlet
    {
        type            patch;
        nFaces          43;
        startFace       1015313;
    }
    atmosphere
    {
        type            patch;
        nFaces          2820;
        startFace       1015356;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1015566;
        startFace       1018176;
    }
    bedSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16483;
        startFace       2033742;
    }
)

// ************************************************************************* //
